[{
  "Employer": "Target",
  "Role": "Senior Engineer",
  "Location": "Minneapolis, MN",
  "TimeFrame": "January 2015 - Current",
  "Responsibilities": [
    "Lead efforts around offering Containers as a Service, using Kubernetes, in Target Stores and distribution Centers",
  "Designed and built highly automated immutable Kubernetes cluster for Stores' edge computing platform Unimatrix – which revolutionized the way Target developers deliver software to our stores.",
  "Designed and implemented a continuous build-test-deployment (CI/CD) system with multiple component pipelines using drone to support our releases and out-of-cycle releases based on business needs. ",
  "Develop, build and maintain cloud infrastructure components and built microservices for platform and clients to consume for easy of working with our cloud platform.",
  "Provided leadership to peers, contractors and 2nd level support, also created architectural and training documentation",
  "Lead transition from manual configuration and deployment to ‘infrastructure as code’ using ansible, including design and implementation of playbooks",
  "Ensured the uninterrupted flow of business-critical operations by introducing the spinnaker canary which deployed a sample app every 10 mins. which reduced ours downtime up to 35%. ",
  "Built full automation for renewing certs from Venafi for Kubernetes Nginx ingress. This includes automatically renewal of certs, build and load new certs to the cluster with extensive monitoring in case any of the automation failed. ",
  "Led custom full docker registry caching solution which integrates with antifactory and Kubernetes for edge clusters to pull the images which reduced the time by 100% ",
  "Developed and implemented software release management strategies for various applications according to agile process.",
  "Built and Managed Spinnker "
  ]
},
{
  "Employer": "Target",
  "Role": "Senior Engineer",
  "Location": "Minneapolis, MN",
  "TimeFrame": "January 2015 - Current",
  "Responsibilities": [
	"Managed the implementation and onboarding of new client accounts",
	"Perform initial sanity checks on documentation packages ensuring all activities are captured, accurately reviewed and processed in a timely fashion",
	"Dealing with customers' requests concerning different changes on their accounts",
	"Automated communication required to advise customers on changes to their accounts"
  ]
},
{
  "Employer": "Target",
  "Role": "Senior Engineer",
  "Location": "Minneapolis, MN",
  "TimeFrame": "January 2015 - Current",
  "Responsibilities": [

  ]
}
]
